<?php

/**
 * 应用程序日志类
 */
class Util {

    /**
     * 记录日志
     * 日志格式：<系统名称>|<模块>|<日志级别>|<发生时间>|<所在机器>|<登录用户>|<客户端IP>|<浏览器信息>|<日志信息>|<其它信息(如Session、堆栈信息、POST/GET等)>
     * LOG_LEVEL INFO ERROR TARCE DEBUG
     * @param str $mssage
     * @param str $line_number  error line.
     * @return status
     */
    public static function log($message, $module, $file_name, $line_number, $level = 'INFO')
    {
        Yii::import('log.models.Log');
        if(is_object($message) || is_array($message)){
            $msg = print_r($message,true);
        }else{
            $msg = $message;
        }

        $model = new Log();
        $model->module = $module;
        $model->level = $level;
        $model->url = Yii::app()->request->getHostInfo() . Yii::app()->request->getUrl();
        $model->type = Yii::app()->request->getRequestType();
        $model->browse = $_SERVER['HTTP_USER_AGENT'];
        $model->client_ip = Yii::app()->request->userHostAddress;
        $model->file_name = $file_name;
        $model->line_number = $line_number;
        $model->msg = $msg;
        $model->param = print_r($_REQUEST,true);
        $model->create_time = time();
        $model->server_ip = $_SERVER['SERVER_ADDR'];
        $model->operator = Yii::app()->user->name;
        $model->id = Yii::app()->getController()->getAutoIncrementKey('bl_log');
        if($model->validate()){
            $model->save();
        }else{
            throw new CException('log model validate error ...');
        }

    }

    /**
     * 提示信息 并跳转父页面
     * @param $url
     */
    public static function header($url, $msg = ''){
        if(!empty($msg)){
            $msg = "alert('{$msg}');";
        }
        $str = <<<EOF
<script language="javascript" charset="utf-8">
{$msg}
parent.location.href = '{$url}';
</script>
EOF;
        echo $str;
        Yii::app()->end();
    }

    /**
     * 提示信息
     */
    public static function message($msg){
        $msg = "alert('{$msg}');";
        $str = <<<EOF
<script language="javascript" charset="utf-8">
{$msg}
</script>
EOF;
        echo $str;
    }

     /**
     * 切割字符串
     * @param array $array
     */
    public static function getSplit($array){
        $list =array();
        $str = str_replace(' ', '', $array);
        $str = str_replace('{{', '{', $str);
        preg_match_all('/\{(.*?)\}/',$str,$arr);
        foreach ($arr[1] as $k => $v){
              $arr = explode(',',$v);
              $list[$arr[0]] = $arr[1];
        }
        return $list;
    }

    /**
     * 切割字符串
     * @param array $array
     */
    public static function getOneSplit($array){
        $str = str_replace(' ', '', $array);
        $str = str_replace('{{', '{', $str);
        preg_match_all('/\{(.*?)\}/',$str,$arr);
        return $arr[1];
    }

    /**
     * 跳转到上一页面
     * @param string $msg
     */
    public static function history($msg = ''){
        if(!empty($msg)){
            $msg = "alert('{$msg}');";
        }
        $str = <<<EOF
<script language="javascript" charset="utf-8">
{$msg}
history.go(-1);
</script>
EOF;
        echo $str;
        Yii::app()->end();
    }

    /**
     * 重新加载页面
     * @param string $msg
     */
    public static function reload($msg = ''){
        if(!empty($msg)){
            $msg = "alert('{$msg}');";
        }
        $str = <<<EOF
<script language="javascript" charset="utf-8">
{$msg}
parent.location.href = parent.location.href;
</script>
EOF;
        echo $str;
        Yii::app()->end();
    }

    /**
     * 数据翻译
     * <?xml version="1.0" encoding="utf-8"?>
        <!--2012-4-28 -4-14 -3-20 -2-29 降低阵法格开启等级，减少阵法特效 -->
        <formations>
            <formationType>
                <item formationTypeId="422001" formationTypeName="通用阵法"/>
                <item formationTypeId="422002" formationTypeName="NPC阵法"/>
            </formationType>
            <formation openLevel="{0,6,11,36,42}">
                <item formationId="422405" formationName="金刚伏魔阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422103,422104,422106,422108}" formationDescription="增加抵挡，阵法等级越高效果越明显" formationIconId="225007" effectResourceId="{{100,705148}}" requiredLevel="30" isDefaultFormation="0">dfdf</item>
                <item formationId="422406" formationName="真武七截阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422104,422105,422108,422109}" formationDescription="增加外功攻击，阵法等级越高效果越明显" formationIconId="225002" effectResourceId="{{100,705128}}" requiredLevel="35" isDefaultFormation="0"/>
                <item formationId="422407" formationName="万蛊噬心阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422102,422103,422105,422108}" formationDescription="增加绝技攻击，阵法等级越高效果越明显" formationIconId="225003" effectResourceId="{{100,705132}}" requiredLevel="42" isDefaultFormation="0"/>
                <item formationId="422408" formationName="五旗圣火阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422102,422103,422104,422106,422107}" formationDescription="增加暴击，阵法等级越高效果越明显" formationIconId="225004" effectResourceId="{{100,705136}}" requiredLevel="44" isDefaultFormation="0"/>
                <item formationId="422501" formationName="天风银雨阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422102,422104,422106,422107,422109}" formationDescription="增加闪避，阵法等级越高效果越明显" formationIconId="225005" effectResourceId="{{100,705140}}" requiredLevel="46" isDefaultFormation="0"/>
                <item formationId="422502" formationName="五都天门阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422103,422105,422107,422109}" formationDescription="增加命中，阵法等级越高效果越明显" formationIconId="225006" effectResourceId="{{100,705141}}" requiredLevel="48" isDefaultFormation="0"/>
                <item formationId="422503" formationName="大五行剑阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422102,422105,422104,422106,422108}" formationDescription="增加外功防御，阵法等级越高效果越明显" formationIconId="225001" effectResourceId="{{0,705100},{100,705124}}" requiredLevel="1" isDefaultFormation="1"/>
                <item formationId="422504" formationName="金锁迷魂阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422102,422105,422108,422109}" formationDescription="增加内功攻击，阵法等级越高效果越明显" formationIconId="225008" effectResourceId="{{100,705149}}" requiredLevel="40" isDefaultFormation="0"/>
                <item formationId="422302" formationName="NPC阵法" formationTypeId="422002" maxLevel="100" requiredSilverToUpgrade="0" positions="0" formationDescription="0" formationIconId="0" effectResourceId="{{100,705100}}" requiredLevel="1" isDefaultFormation="0"/>
            </formation>
            <rolePosition>
               <position>
                   {90,360},{220,360},{350,360},
                   {65,445},{195,445},{325,445},
                   {40,530},{170,530},{300,530}
               </position>
               <position>
                   {650,360},{780,360},{910,360},
                   {675,445},{805,445},{935,445},
                   {700,530},{830,530},{960,530}
               </position>
            </rolePosition>
        </formations>
     * $file_name 文件名称
     * item 递归循环的xml选项
     * attribute 匹配的属性
     * $return_key 返回的属性
     * $attribute_value 匹配的属性值
     * @return string
     */
     public static function translation($file_name, $item, $attribute, $attribute_value, $return_key = null){
        $xml = dirname(__DIR__) . '/data/' . $file_name . '.xml';
        if(file_exists($xml)){
            $result = null;
            $xml = simplexml_load_file($xml);
            if(count($item)){
                foreach ($item as $value) {
                    $xml = $xml->$value;
                }
            }
            $childrens = $xml->children();
            if(count($childrens)){
                foreach ($childrens as $v) {
                    if($v[$attribute] == $attribute_value){
                        if(empty($return_key)){
                            $result = $v;
                        }else{
                            $result = $v[$return_key];
                        }
                        break;
                    }
                }
            }
            return $result;
        }else{
            throw new CException("File {$xml} not exist");
        }
    }

    /**
     * 数据翻译
     * <?xml version="1.0" encoding="utf-8"?>
        <!--2012-4-28 -4-14 -3-20 -2-29 降低阵法格开启等级，减少阵法特效 -->
        <formations>
            <formationType>
                <item formationTypeId="422001" formationTypeName="通用阵法"/>
                <item formationTypeId="422002" formationTypeName="NPC阵法"/>
            </formationType>
            <formation openLevel="{0,6,11,36,42}">
                <item formationId="422405" formationName="金刚伏魔阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422103,422104,422106,422108}" formationDescription="增加抵挡，阵法等级越高效果越明显" formationIconId="225007" effectResourceId="{{100,705148}}" requiredLevel="30" isDefaultFormation="0">dfdf</item>
                <item formationId="422406" formationName="真武七截阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422104,422105,422108,422109}" formationDescription="增加外功攻击，阵法等级越高效果越明显" formationIconId="225002" effectResourceId="{{100,705128}}" requiredLevel="35" isDefaultFormation="0"/>
                <item formationId="422407" formationName="万蛊噬心阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422102,422103,422105,422108}" formationDescription="增加绝技攻击，阵法等级越高效果越明显" formationIconId="225003" effectResourceId="{{100,705132}}" requiredLevel="42" isDefaultFormation="0"/>
                <item formationId="422408" formationName="五旗圣火阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422102,422103,422104,422106,422107}" formationDescription="增加暴击，阵法等级越高效果越明显" formationIconId="225004" effectResourceId="{{100,705136}}" requiredLevel="44" isDefaultFormation="0"/>
                <item formationId="422501" formationName="天风银雨阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422102,422104,422106,422107,422109}" formationDescription="增加闪避，阵法等级越高效果越明显" formationIconId="225005" effectResourceId="{{100,705140}}" requiredLevel="46" isDefaultFormation="0"/>
                <item formationId="422502" formationName="五都天门阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422103,422105,422107,422109}" formationDescription="增加命中，阵法等级越高效果越明显" formationIconId="225006" effectResourceId="{{100,705141}}" requiredLevel="48" isDefaultFormation="0"/>
                <item formationId="422503" formationName="大五行剑阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422102,422105,422104,422106,422108}" formationDescription="增加外功防御，阵法等级越高效果越明显" formationIconId="225001" effectResourceId="{{0,705100},{100,705124}}" requiredLevel="1" isDefaultFormation="1"/>
                <item formationId="422504" formationName="金锁迷魂阵" formationTypeId="422001" maxLevel="100" requiredSilverToUpgrade="{0,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000,20000,30000,40000,50000,60000,70000,80000,90000,100000,125000,150000,175000,200000,225000,250000,275000,300000,320000,340000,360000,380000,400000,420000,440000,460000,480000,500000,550000,600000,650000,700000,750000,800000,850000,900000,950000,1000000,1100000,1200000,1300000,1400000,1500000,1600000,1700000,1800000,1900000,2000000,2250000,2500000,2750000,3000000,3250000,3500000,3750000,4000000,4250000,4500000,4750000,5000000,5250000,5500000,5750000,6000000,6250000,6500000,6750000,7000000,7250000,7500000,7750000,8000000,8250000,8500000,8750000,9000000,9250000,9500000,9750000,10000000,10500000,11000000,11500000,12000000,12500000,13000000,13500000,14000000,14500000,15000000}" positions="{422101,422102,422105,422108,422109}" formationDescription="增加内功攻击，阵法等级越高效果越明显" formationIconId="225008" effectResourceId="{{100,705149}}" requiredLevel="40" isDefaultFormation="0"/>
                <item formationId="422302" formationName="NPC阵法" formationTypeId="422002" maxLevel="100" requiredSilverToUpgrade="0" positions="0" formationDescription="0" formationIconId="0" effectResourceId="{{100,705100}}" requiredLevel="1" isDefaultFormation="0"/>
            </formation>
            <rolePosition>
               <position>
                   {90,360},{220,360},{350,360},
                   {65,445},{195,445},{325,445},
                   {40,530},{170,530},{300,530}
               </position>
               <position>
                   {650,360},{780,360},{910,360},
                   {675,445},{805,445},{935,445},
                   {700,530},{830,530},{960,530}
               </position>
            </rolePosition>
        </formations>
           $data = array(
                    'formations' => array(
                                        'item' => array('formation'),
                                        'attribute' => array(
                                                             'formationName' => array(
                                                                                 	'id' => 'formationId',
                                                                                    'value' => array('422405', '422408', '422407'),
                                                                                ),
                                                             'formationId' => array(
                                                                                     'id' => 'formationName',
                                                                                     'value' => array('大五行剑阵', '金锁迷魂阵')
                                                                                )
                                                          )
                                    ),
                    'books' => array(
                                 'item' => array(),
                                 'attribute' => array(
                                                     'bookName' => array(
                                                                         'id' => 'bookId',
                                                                         'value' => array('472103', '472104', '472105')
                                                                         ),
                                                     'bookId' => array(
                                                                         'id' => 'bookName',
                                                                         'value' => array('洗髓经')
                                                                         )
                                                 )
                                )
                );
     *
     * formations 文件名称
     * item 递归循环的xml选项
     * attribute 匹配的属性
     * formationName 返回的属性
     * formationId 匹配的属性值数组
     * Util::translation($data);
     * @return array
     */
    public static function translationMuti($data){
        $result = array();
        $list = array();
        foreach ($data as $key => $value) {
            $xml = dirname(__DIR__) . '/data/' . $key . '.xml';
            if(file_exists($xml)){
                $xml = simplexml_load_file($xml);
                if(count($value['item'])){
                    foreach ($value['item'] as $item) {
                        $xml = $xml->$item;
                    }
                }
                $children = $xml->children();
                if(count($children)){
                    foreach ($children as $v) {
                         foreach ($value['attribute'] as $return_key => $attribute) {
                             if(in_array($v[$attribute['id']], $attribute['value'])){
                                 $index = $v[$attribute['id']];
                                 if(is_numeric($return_key)){
                                     $return_value = $v;
                                 }else{
                                     $return_value = $v[$return_key];
                                 }
                                 array_push($result, $index . '@' . $return_value);
                                 break;
                             }
                         }
                    }
                }
                if(count($result)){
                    foreach ($result as $v) {
                        $arr = explode('@', $v);
                        $list[$key][$arr[0]] = $arr[1];
                    }
                }
            }else{
                throw new CException("File {$xml} not exist");
            }
        }
        return count($data) > 1 ? $list : $list[$key];
    }

    /**
     * 根据主键获取服务器名称
     * @param int $server_id
     */
    public static function getServerName($server_id){
        Yii::import('passport.models.Server');
        $server = Server::model()->findByPk(intval($server_id));
        return empty($server) ? '' : $server->sname;
    }

    /**
     * 获取服务器下拉框数据
     */
    public static function getServerSelect(){
        Yii::import('passport.models.Server');
        $servers = Server::model()->findAll();
        $select = array();
        if(count($servers)){
            foreach ($servers as $k => $v) {
                $select[$v->id] = $v->sname;
            }
        }
        return $select;
    }

    /**
     * 根据server_id获取服务器信息
     * @param int $server_id
     */
    public static function getServerAttribute($server_id, $attribute = null){
        Yii::import('passport.models.Server');
        $server = Server::model()->findByAttributes(array('server_id' => intval($server_id)));
        return empty($attribute) ? $server : ($server->$attribute);
    }
    
    /**
     * 获取server_id对应服务器下拉框数据
     */
    public static function getRealServerSelect(){
        Yii::import('passport.models.Server');
        $servers = Server::model()->findAll();
        $select = array();
        if(count($servers)){
            foreach ($servers as $k => $v) {
                $select[$v->server_id] = $v->sname;
            }
        }
        return $select;
    }
}
